cask_args appdir: "/Applications"
tap "caskroom/cask"

# basic
brew "zsh"
brew "bash"

# language and middleware
brew "go"
brew "msgpack"
brew "npm"
brew "openssl"
brew "postgresql"
brew "python3"
brew "redis@3.2"
cask "java"
brew "sbt"
brew "scala"
cask "docker"

# tools
brew "curl"
brew "colordiff"
brew "direnv"
brew "less"
brew "graphviz"
brew "jq"
brew "nkf"
brew "terraform"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
cask "google-chrome"
cask "firefox"
cask "karabiner-elements"
cask "jasper"
cask "iterm2"
cask "alfred"
cask "dropbox"
cask "intellij-idea"
cask "visual-studio-code"
cask "dash"
cask "amethyst"
cask "zoomus"
cask "adobe-acrobat-reader"
mas "1Password", id: 443987910
cask "1password-cli"
mas "Slack", id: 803453959

# font
cask "caskroom/fonts/font-migu-1m"
